public class ex_01_IntroCycles {
    public static void main(String[] args) {
        /*
            Цикл - конструкция в программировании, позволяющая дублировать определенное действие определенное число раз.

            Основные циклы:
            1. for - счетчик;
            2. while - цикл с предусловием;
            3. do while - цикл с постуловием.

            Итерация - один оборот цикла;
            Инкремент - увеличение на единицу;
            Декремент - уменьшение на единицу.
        */
    }
}
