public class ex_01_LogicOperators {
   public static void main(String[] args){
        /*
            boolean - тип данных, хранящих логические значения.
            Логические значения:
            1. true - истина;
            2. false - ложь.
            
        */    
    
        // System.out.println(17 > 15); - Логическое выражение
        // System.out.println(23 += 23); - Использование оператора сравнения

        /*
            
            Операторы сравнения:
            1. == - сравнить;
            2. > - больше;
            3. < - меньше;
            4. >= - больше равно;
            5. <= - меньше равно;
            6. != - не равно;
        
            Логические операторы:
            1. && - и;
            2. || - или;
            3. ! - не.
        */

        int a = 12, b = 21;

        System.out.println(a > b && b != a); // 12 больше 21 и 12 не равно 21
        System.out.println(a == b || a < b); // 12 равно 21 или 12 меньше 21
        System.out.println(!true); // не правда = ложь
   } 
}
