public class ex_02_IfElse {
   public static void main(String[] args){
        /*
            Условные конструкции - конструкции позволяющие производить разветвления в программном коде

            if и else - конструкции позволяющие разветвлять код

            if - если
            else - иначе

            Синтаксис:
            if(<условие>){
                <тело_условия> - код, который будет выполняться
            }
            else if(<альтернативное >){
                <тело_альтернативного_условия> - код, который будет выполняться
            }
            else{
                код, который выполниться в случае если все условия и альтернативные условия окажутся ложными    
            } 
        */

        // Пример 1. Разветвление
        int age = 17; // Возраст

        if (age >= 18) {
            System.out.println("Добро пожаловать!");
        } else if (age >= 14) {
            System.out.println("Нужно согласие родителей.");
        } else {
            System.out.println("Доступ запрещён.");
        }
}
